Repository: GhislainL/FormI18n
Catalog: XmlLocalizationSample/XmlLocalizationSample/LocalizationResources/LocSource.*.resx
Languages: ar

source: Welcome
ar: مرحبا

source: &lt;p&gt;Learn about &lt;a href=&quot;{0}&quot;&gt; building Web apps with ASP.NET Core&lt;/a&gt;.&lt;/p&gt; &lt;p&gt;Learn about &lt;a href=&quot;{1}&quot;&gt; XLocalizer for ASP.NET Core&lt;/a&gt;.&lt;/p&gt;
ar: <p style=";text-align:right;direction:rtl"> تعرف على كيفية <a href="{0}">إنشاء تطبيقات الويب باستخدام ASP.NET Core</a> . </p><p style=";text-align:right;direction:rtl"> تعرف على <a href="{1}">XLocalizer لـ ASP.NET Core</a> . </p>

source: Home page
ar: الصفحة الرئيسية

source: Register
ar: تسجيل

source: Login
ar: تسجيل الدخول

source: Home
ar: الرئيسية

source: Privacy
ar: خصوصية

source: Localized {0} Errors
ar: أخطاء {0} مترجمة

source: Export Resources
ar: موارد التصدير

source: Privacy Policy
ar: سياسة الخصوصية

source: Use this page to detail your site's privacy policy.
ar: استخدم هذه الصفحة لتفصيل سياسة الخصوصية الخاصة بموقعك.

source: To see localized {0} errors run below steps: &lt;ul&gt; &lt;li&gt;Submit the form without typing any value.&lt;/li&gt; &lt;li&gt;Submit the form with a string value, e.g.: &quot;A&quot;.&lt;/li&gt; &lt;li&gt;Submit the form with a number.&lt;/li&gt; &lt;/ul&gt; &lt;p&gt;Read more about &lt;a href=&quot;{1}&quot;&gt;{0} in Asp.Net Core&lt;/a&gt;&lt;/p&gt;
ar: لرؤية أخطاء {0} مترجمة ، اتبع الخطوات التالية: <ul style=";text-align:right;direction:rtl"><li style=";text-align:right;direction:rtl"> أرسل النموذج دون كتابة أي قيمة. </li><li style=";text-align:right;direction:rtl"> أرسل النموذج بقيمة سلسلة ، مثل: &quot;A&quot;. </li><li style=";text-align:right;direction:rtl"> أرسل النموذج برقم. </li></ul><p style=";text-align:right;direction:rtl"> اقرأ المزيد عن <a href="{1}">{0} في Asp.Net Core</a> </p>

source: What is your age?
ar: كم عمرك؟

source: Age
ar: سنك

source: OK
ar: موافق

source: Model Binding Errors
ar: أخطاء ربط النموذج

source: The value '{0}' is invalid.
ar: القيمة غير صالحة.

source: The value '{0}' is not valid for {1}.
ar: القيمة &quot;{0}&quot; غير صالحة لـ {1}.

source: Resource Exporter
ar: مصدر الموارد

source: Use this exporter if to export all resources from &quot;.xml&quot; to &quot;.resx&quot; files.
ar: استخدم هذا المصدر إذا كان لتصدير جميع الموارد من ملفات &quot;.xml&quot; إلى &quot;.resx&quot;.

source: &lt;h3&gt;Important Notice!&lt;/h3&gt; &lt;p&gt;After exporting the resources from &quot;.xml&quot; to &quot;.resx&quot;, the application will restart at the first request.&lt;/p&gt; &lt;p&gt;That is because the application needs to compile &quot;.resx&quot; files into binary format &quot;.resources&quot;.&lt;/p&gt;
ar: <h3 style=";text-align:right;direction:rtl"> ملاحظة هامة! </h3><p style=";text-align:right;direction:rtl"> بعد تصدير الموارد من &quot;.xml&quot; إلى &quot;.resx&quot; ، سيتم إعادة تشغيل التطبيق عند الطلب الأول. </p><p style=";text-align:right;direction:rtl"> وذلك لأن التطبيق يحتاج إلى ترجمة ملفات &quot;.resx&quot; إلى تنسيق ثنائي &quot;.resources&quot;. </p>

source: Export approved resources only.
ar: تصدير الموارد المعتمدة فقط.

source: Export all resources.
ar: تصدير جميع الموارد.

source: Don't overwrite existing resources.
ar: لا تستبدل الموارد الموجودة.

source: Overwrite existing resources.
ar: استبدال الموارد الموجودة.

source: Select culture to export
ar: حدد الثقافة للتصدير

source: Close
ar: إغلاق

source: Export
ar: تصدير

source: Create a new account.
ar: إنشاء حساب جديد

source: Email
ar: البريد الإلكتروني

source: The {0} field is required.
ar: هذا الحقل مطلوب.

source: The {0} field is not a valid e-mail address.
ar: الحقل {0} ليس عنوان بريد إلكتروني صالح.

source: Password
ar: كلمة المرور

source: The field {0} must be a string with a maximum length of {1}.
ar: يجب أن يكون الحقل {0} سلسلة بحد أقصى للطول {1}.

source: Confirm password
ar: تأكيد كلمة المرور

source: '{0}' and '{1}' do not match.
ar: لا يتطابق &#39;{0}&#39; و &#39;{1}&#39;.

source: Use another service to register.
ar: استخدم خدمة أخرى للتسجيل.

source: There are no external authentication services configured. See &lt;a href=&quot;{0}&quot;&gt;this article&lt;/a&gt; for details on setting up this ASP.NET application to support logging in via external services.
ar: لم يتم تكوين خدمات مصادقة خارجية. راجع <a href="{0}">هذه المقالة</a> للحصول على تفاصيل حول إعداد تطبيق ASP.NET هذا لدعم تسجيل الدخول عبر الخدمات الخارجية.

source: Log in
ar: تسجيل دخول

source: Use a local account to log in.
ar: استخدم حساب محلي لتسجيل الدخول.

source: Remember me?
ar: تذکرني؟

source: Forgot your password?
ar: نسيت كلمة المرور؟

source: Register as a new user
ar: تسجيل مستخدم جديد

source: Resend email confirmation
ar: إعادة إرسال تأكيد البريد الإلكتروني

source: Use another service to log in.
ar: استخدم خدمة أخرى لتسجيل الدخول.

source: There are no external authentication services configured. See &lt;a href=&quot;{0}&quot;&gt; this article&lt;/a&gt; for details on setting up this ASP.NET application to support logging in via external services.
ar: لم يتم تكوين خدمات مصادقة خارجية. راجع <a href="{0}">هذه المقالة</a> للحصول على تفاصيل حول إعداد تطبيق ASP.NET هذا لدعم تسجيل الدخول عبر الخدمات الخارجية.
